
**Terraform apply** (Okta preview) ran in [4 seconds](https://github.com/evanyeung-clear/terraform-ci/actions/runs/20108062331).
```
terraform apply -no-color -input=false -auto-approve -target=okta_user.test2 -target=okta_user.test3 -target=okta_user.test1
```

<details>
<summary>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
</summary>

```
[INFO] Starting Terraform preprocessing in terraform environment...
[INFO] Cleaning up existing temporary files...
[INFO] Consolidating .tf files from subdirectories into _consolidated.tf...
[INFO] Consolidated 0 files into _consolidated.tf
[INFO] Running terraform with arguments: apply -no-color -input=false -auto-approve -target=okta_user.test2 -target=okta_user.test3 -target=okta_user.test1
[INFO] Using terraform executable: /usr/local/bin/terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # okta_user.test1 will be created
  + resource "okta_user" "test1" {
      + custom_profile_attributes = (known after apply)
      + email                     = "example@example.com"
      + expire_password_on_create = false
      + first_name                = "John"
      + id                        = (known after apply)
      + last_name                 = "Smith"
      + login                     = "example@example.com"
      + raw_status                = (known after apply)
      + skip_roles                = false
      + status                    = "ACTIVE"
    }

  # okta_user.test2 will be created
  + resource "okta_user" "test2" {
      + custom_profile_attributes = (known after apply)
      + email                     = "example2@example.com"
      + expire_password_on_create = false
      + first_name                = "John"
      + id                        = (known after apply)
      + last_name                 = "Smith"
      + login                     = "example2@example.com"
      + raw_status                = (known after apply)
      + skip_roles                = false
      + status                    = "ACTIVE"
    }

  # okta_user.test3 will be created
  + resource "okta_user" "test3" {
      + custom_profile_attributes = (known after apply)
      + email                     = "example3@example.com"
      + expire_password_on_create = false
      + first_name                = "John"
      + id                        = (known after apply)
      + last_name                 = "Smith"
      + login                     = "example3@example.com"
      + raw_status                = (known after apply)
      + skip_roles                = false
      + status                    = "ACTIVE"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
okta_user.test1: Creating...
okta_user.test3: Creating...
okta_user.test2: Creating...
okta_user.test1: Creation complete after 2s [id=00uy8c02v2uIRV2FQ697]
okta_user.test2: Creation complete after 2s [id=00uy8bww4wFmIZSXH697]
okta_user.test3: Creation complete after 3s [id=00uy8bwz3gwkdtetf697]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
[INFO] Cleaning up temporary file...

```
</details>
